import fetch from 'node-fetch'
let handler = async (m, { args, usedPrefix, command }) => {
    
try{
    const minReaderId = 1;
    const maxReaderId = 158;
    const minSuraId = 1;
    const maxSuraId = 114;
    if (!args) {
        throw `👈🏼 *يجب عليك كتابة رقم المقرئ ورقم السورة:* \n\n_مثال:_\n${usedPrefix + command} (رقم المقرئ) (رقم السورة)\n\n*لائحة المقرئين:*

1- أحمد الحواشي (رواية حفص)
2- أحمد السويلم (رواية حفص)
3- أحمد الطرابلسي (رواية حفص)
4- أحمد بن علي العجمي (رواية حفص)
5- أحمد خضر الطرابلسي (قالون عن نافع)
6- أحمد خليل شاهين (رواية حفص)
7- أحمد ديبان (شعبة عن عاصم)
8- أحمد ديبان (البزي عن ابن كثير)
9- أحمد ديبان (قالون عن نافع)
10- أحمد ديبان (قنبل عن ابن كثير)
11- أحمد ديبان (رواية حفص)
12- أحمد ديبان (الدوري عن أبي عمرو)
13- أحمد صابر (رواية حفص)
14- أحمد عامر (رواية حفص)
15- أحمد عيسى المعصراوي (رواية حفص)
16- أحمد نعينع (رواية حفص)
17- أكرم العلاقمي (رواية حفص)
18- إبراهيم الأخضر (رواية حفص)
19- إبراهيم الجرمي (رواية حفص)
20- إبراهيم الدوسري (رواية ورش)
21- إبراهيم الدوسري (رواية حفص)
22- إبراهيم كشيدان (قالون عن نافع)
23- الدوكالي محمد العالم (قالون عن نافع)
24- الزين محمد أحمد (رواية حفص)
25- العيون الكوشي (رواية ورش)
26- الفاتح محمد الزبير (الدوري عن أبي عمرو)
27- القارئ ياسين (رواية ورش)
28- بدر التركي (رواية حفص)
29- بندر بليله (رواية حفص)
30- بيشه وا قادر الكردي (رواية حفص)
31- توفيق الصايغ (رواية حفص)
32- جمال شاكر عبدالله (رواية حفص)
33- جمعان العصيمي (رواية حفص)
34- حاتم فريد الواعر (رواية حفص)
35- خالد الجليل (رواية حفص)
36- خالد القحطاني (رواية حفص)
37- خالد المهنا (رواية حفص)
38- خالد عبدالكافي (رواية حفص)
39- خالد كريم محمدي (رواية حفص)
40- خليفة الطنيجي (رواية حفص)
41- رامي الدعيس (رواية حفص)
42- رشيد بلعالية (رواية ورش)
43- زكي داغستاني (رواية حفص)
44- سعد الغامدي (رواية حفص)
45- سعد المقرن (رواية حفص)
46- سعود الشريم (رواية حفص)
47- سلمان الصديق (رواية حفص)
48- سهل ياسين (رواية حفص)
49- سيد أحمد هاشمي (رواية حفص)
50- سيد رمضان (رواية حفص)
51- شيخ أبو بكر الشاطري (رواية حفص)
52- شيرزاد عبدالرحمن طاهر (رواية حفص)
53- صابر عبدالحكم (رواية حفص)
54- صالح الشمراني (رواية حفص)
55- صالح الهبدان (رواية حفص)
56- صلاح البدير (رواية حفص)
57- صلاح الهاشم (رواية حفص)
58- صلاح بو خاطر (رواية حفص)
59- طارق عبدالغني دعوب (قالون عن نافع)
60- عادل الكلباني (رواية حفص)
61- عادل ريان (رواية حفص)
62- عبدالإله بن عون (رواية حفص)
63- عبدالبارئ الثبيتي (رواية حفص)
64- عبدالبارئ محمد (رواية حفص)
65- عبدالباسط عبدالصمد (مجود)
66- عبدالباسط عبدالصمد (رواية حفص)
67- عبدالباسط عبدالصمد (رواية ورش)
68- عبدالرحمن السديس (رواية حفص)
69- عبدالرحمن العوسي (رواية حفص)
70- عبدالرحمن الماجد (رواية حفص)
71- عبدالرشيد صوفي (رواية حفص)
72- عبدالرشيد صوفي (خلف عن حمزة)
73- عبدالرشيد صوفي (السوسي عن أبي عمرو)
74- عبدالعزيز الأحمد (رواية حفص)
75- عبدالعزيز الزهراني (رواية حفص)
76- عبدالله الخلف (رواية حفص)
77- عبدالله الكندري (رواية حفص)
78- عبدالله المطرود (رواية حفص)
79- عبدالله بصفر (رواية حفص)
80- عبدالله خياط (رواية حفص)
81- عبدالله عبدل (رواية حفص)
82- عبدالله عواد الجهني (رواية حفص)
83- عبدالله غيلان (رواية حفص)
84- عبدالله كامل (رواية حفص)
85- عبدالمحسن الحارثي (رواية حفص)
86- عبدالمحسن العبيكان (رواية حفص)
87- عبدالمحسن القاسم (رواية حفص)
88- عبدالهادي أحمد كناكري (رواية حفص)
89- عبدالودود حنيف (رواية حفص)
90- علي الحذيفي (رواية حفص)
91- علي الحذيفي (قالون عن نافع)
92- علي جابر (رواية حفص)
93- علي حجاج السويسي (رواية حفص)
94- عماد زهير حافظ (رواية حفص)
95- عمر القزابري (رواية ورش)
96- فؤاد الخامري (رواية حفص)
97- فارس عباد (رواية حفص)
98- ماجد الزامل (رواية حفص)
99- مال الله عبدالرحمن الجابر (رواية حفص)
100- ماهر المعيقلي (مجود)
101- ماهر المعيقلي (مرتل)
102- ماهر شخاشيرو (رواية حفص)
103- محمد أبوسنينة (قالون عن نافع)
104- محمد أيوب (رواية حفص)
105- محمد الأمين قنيوة (قالون عن نافع)
106- محمد الطبلاوي (رواية حفص)
107- محمد اللحيدان (رواية حفص)
108- محمد جبريل (رواية حفص)
109- محمد رشاد الشريف (رواية حفص)
110- محمد سايد (رواية ورش)
111- محمد صالح عالم شاه (رواية حفص)
112- محمد صديق المنشاوي (مرتل)
113- محمد صديق المنشاوي (مجود)
114- محمد صديق المنشاوي (تكرار)
115- محمد عبدالحكيم العبدالله (البزي وقنبل عن ابن كثير)
116- محمد عبدالحكيم العبدالله (الدوري عن الكسائي)
117- محمد عبدالكريم (رواية ورش من طريق أبي بكر الأصبهاني)
118- محمد عبدالكريم (رواية حفص)
119- محمد عثمان خان (رواية حفص)
120- محمود الرفاعي (رواية حفص)
121- محمود الشيمي (الدوري عن الكسائي)
122- محمود خليل الحصري (رواية حفص)
123- محمود خليل الحصري (قالون عن نافع)
124- محمود خليل الحصري (الدوري عن أبي عمرو)
125- محمود خليل الحصري (رواية ورش)
126- محمود خليل الحصري (رواية حفص)
127- محمود عبدالحكم (رواية حفص)
128- محمود علي البنا (مرتل)
129- محمود علي البنا (مجود)
130- مروان العكري (قالون عن نافع)
131- مشاري العفاسي (رواية حفص)
132- مصطفى إسماعيل (مجود)
133- مصطفى إسماعيل (رواية حفص)
134- مصطفى اللاهوني (رواية حفص)
135- مصطفى رعد العزاوي (رواية حفص)
136- معيض الحارثي (رواية حفص)
137- مفتاح السلطني (الدوري عن الكسائي)
138- مفتاح السلطني (ابن ذكوان عن ابن عامر)
139- مفتاح السلطني (الدوري عن أبي عمرو)
140- مفتاح السلطني (رواية حفص)
141- موسى بلال (رواية حفص)
142- ناصر القطامي (رواية حفص)
143- ناصر الماجد (رواية حفص)
144- نبيل الرفاعي (رواية حفص)
145- نذير المالكي (رواية حفص)
146- نعمة الحسان (رواية حفص)
147- نورين محمد صديق (الدوري عن أبي عمرو)
148- هاشم أبو دلال (رواية حفص)
149- هاني الرفاعي (رواية حفص)
150- وديع اليمني (رواية حفص)
151- وليد النائحي (قالون عن نافع من طريق أبي نشيط)
152- ياسر الدوسري (رواية حفص)
153- ياسر القرشي (رواية حفص)
154- ياسر المزروعي (قراءة يعقوب الحضرمي بروايتي رويس وروح)
155- ياسر سلامة (رواية حفص)
156- يحيى حوا (رواية حفص)
157- يوسف الشويعي (رواية حفص)
158- يوسف بن نوح أحمد (رواية حفص)`;
    }
    let readerId = args[0];
    let suraId = args[1];
    if(!suraId){suraId = args[0]; readerId = '142'}
    if (isNaN(readerId) || isNaN(suraId) || readerId < minReaderId || readerId > maxReaderId || suraId < minSuraId || suraId > maxSuraId) {
        throw `👈🏼 *الرجاء التأكد من أن رقم المقرئ بين ${minReaderId} و ${maxReaderId} ورقم السورة بين ${minSuraId} و ${maxSuraId}*`;
    }
    console.log(suraId, readerId)
  const response = await fetch('https://raw.githubusercontent.com/Alsarmad/whatsapp_adhkar/main/files/json/mp3quran.json');
   const ress = await fetch('https://raw.githubusercontent.com/midsoune/JSON/main/quran.json');
    const json = await response.json();
   const jso = await ress.json();
    const reader = json[readerId - 1];
   if (reader) {
    const suraUrl = `${reader.Server}/${suraId.toString().padStart(3, '0')}.mp3`;
   const suraUr = `https://server6.mp3quran.net/qtm/${suraId.toString().padStart(3, '0')}.mp3`;
if (args.length == 2) { 
  await conn.reply(m.chat, `📜 *السورة: ${jso[args[1] - 1].asma.ar.long}*\n👳🏻‍♂️ *القارئ: ${reader.name}*`, null);
      conn.sendFile(m.chat, suraUrl, `${suraId}_ ${jso[suraId - 1].asma.ar.long}.mp3`, `${suraId}_ ${jso[suraId - 1].asma.ar.long}.mp3`, null, null, {mimetype: 'audio/mpeg', asDocument: false});
} 
else if (args.length == 1) {
  await conn.reply(m.chat, `📜 *السورة: ${jso[suraId - 1].asma.ar.long}*\n👳🏻‍♂️ *القارئ: ناصر القطامي*`, null);
      conn.sendFile(m.chat, suraUr, `${suraId}_ ${jso[suraId - 1].asma.ar.long}.mp3`, `${suraId}_ ${jso[suraId - 1].asma.ar.long}.mp3`, null, null, {mimetype: 'audio/mpeg', asDocument: false});
}} else {
        throw `👈🏼 *المقرئ رقم ${readerId} غير موجود*`;
    }} catch (error){
    console.log(error);
    }
};

handler.command = /^(qm|quranmp3|suramp3)$/i;
export default handler;
